Tekla.Structures.Datatype.Boolean
The Boolean datatype.
Remarks:
The purpose of this type is to enable dialog field binding with StructuresExtender.
You don't need to use this type in your own programs.

Tekla.Structures.Datatype.Boolean.#ctor(System.Boolean)
Initializes a new instance of the structure.
boolValue: The boolean value.

Tekla.Structures.Datatype.Boolean.Value
Gets or sets the boolean value.

Tekla.Structures.Datatype.Boolean.boolValue
Boolean value.

Tekla.Structures.Datatype.Boolean.GetSchema


Tekla.Structures.Datatype.Boolean.ReadXml(System.Xml.XmlReader)


Tekla.Structures.Datatype.Boolean.WriteXml(System.Xml.XmlWriter)
